# 10. Дано число P і число H. Користувач вводить послідовність чисел. Визначити: суму тих чисел, які менше P;
# добуток чисел, які більші за H; кількість чисел, що знаходяться в діапазоні значень від P до H.
# При введенні числа рівного P або H, припинити обчислення та вивести результат. (не використовувати білдін функції)
p = 15
h = 49
n = int(input("Скільки чисел ви хочете ввести: "))
suma = 0
dob = 1
num = 0
i = 1
while i <= n:
    k = float(input("Введіть дійсне число  :  "))
    i += 1
    if k < p:
        suma = suma + k
    elif k > h:
        dob = dob * k
    elif p < k < h:
        num = num + 1
    elif k == p or k == h:
        break
print(suma, ' - сума менших Р')
print(dob, ' - добуток більших Н')
print(num, ' - в діапазоні між Р і Н')
