# 3. Для довільних дійсних чисел `a`, `b`, і `c` визначити, чи має рівняння
# `ax2+bx+c=0` хоча б один дійсний корінь і якщо так, то видрукувати
# його.

a = input("Для рівняння аx2+bx+c=0 введіть значення а : \n ")
a = float(a)
b = input("Для рівняння аx2+bx+c=0 введіть значення b : \n ")
b = float(b)
c = input("Для рівняння аx2+bx+c=0 введіть значення а : \n ")
c = float(c)
d = b**2 - 4*a*c
x = (-b + d**0.5)/(2*a)
if d < 0:
    print (" Рівняння не має дійсних коренів")
else:
    print ("Один з коренів рівняння", x)