# У програмі генерується випадкове ціле число від 0 до 100. Користувач повинен його відгадати не більше ніж за 10 спроб.
# Після кожної невдалої спроби повинно повідомлятися чи більше чи менше введене користувачем число, ніж те,
# що загадане. Якщо за 10 спроб число не відгадане, то вивести загадане число.
import random
n = random.randint(0, 100)
i = 1
for i in range(10):
    k = int(input("Введіть від 1 до 100 : "))
    if k == n:
        print('Ви вгадали')
        break
    elif k > n:
        print('Загадане число менше')
    elif k < n:
        print('Загадане число більше')
else:
        print('На жаль ви не вгадали за 10 спроб число', n)




