# Заповнити один список випадковими числами, інший - введеними з клавіатури числами, в третій записати суми відповідних
# елементів перших двох. Вивести вміст списків на екран.
n = int(input('Скільки чисел ви хочете ввести :  '))
import random
a = []
for i in range(n):
    x = random.randint(1, 1000)
    a.append(x)
b = []
for i in range(n):
    y = int(input('Введіть число:  '))
    b.append(y)
c = [a[i] + b[i] for i in range(n)]
print('Введено', b)
print('Згенеровано', a)
print('Сума відповідних елементів', c)
