#6. У другому списку зберегти індекси парних елементів першого списку.
# Наприклад, якщо дано список зі значеннями 8, 3, 15, 6, 4, 2, то
# другий треба заповнити значеннями 1, 4, 5, 6 (або 0, 3, 4, 5 - якщо індексація починається з нуля),
# оскільки саме в цих позиціях першого масиву стоять парні числа.

import random
rand_list = []
even_ind_list = []
i = 0
for i in range(10):
    n = random.randint(0, 10)
    rand_list.append(n)
    if n % 2 == 0:
        n = even_ind_list.append(i)
        i += 1
print(f"{rand_list}\n" 
      f"{even_ind_list}")
